eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияПоказателейДляРасчетаКПЭ/абс_ЗначенияПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияПоказателейДляРасчетаКПЭ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыАналитикиЗначенийПоказателейКПЭ/абс_ВидыАналитикиЗначенийПоказателейКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыАналитикиЗначенийПоказателейКПЭ</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>ШтатнаяЕдиница</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>Общий</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</name>
  <enumValues>
    <name>ПлановыеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПлановыхЗначений</name>
  </enumValues>
  <enumValues>
    <name>ФактическиеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаФактическихЗначений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияПоказателейДляРасчетаКПЭ/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеЗаписейРегистра(Отказ);
	
КонецПроцедуры

Функция ПолучитьСоответствиеВидовАналитик()
	          
	СоответствиеВидовАналитик = Новый Соответствие;
	
	СтруктураАналитикОбщий = Новый Структура();
	СтруктураАналитикОбщий.Вставить("Подразделение"				, Ложь);
	СтруктураАналитикОбщий.Вставить("Должность"					, Ложь);
	СтруктураАналитикОбщий.Вставить("Сотрудник"					, Ложь);
		
	СоответствиеВидовАналитик.Вставить(Перечисления.абс_ВидыАналитикиЗначенийПоказателейКПЭ.Общий, СтруктураАналитикОбщий);
	
	СтруктураАналитикПодразделение = Новый Структура();
	СтруктураАналитикПодразделение.Вставить("Подразделение"		, Истина);
	СтруктураАналитикПодразделение.Вставить("Должность"			, Ложь);
	СтруктураАналитикПодразделение.Вставить("Сотрудник"			, Ложь);
		
	СоответствиеВидовАналитик.Вставить(Перечисления.абс_ВидыАналитикиЗначенийПоказателейКПЭ.Подразделение, СтруктураАналитикПодразделение);
	
	СтруктураАналитикШтатнаяЕдиница = Новый Структура();
	СтруктураАналитикШтатнаяЕдиница.Вставить("Подразделение"	, Истина);
	СтруктураАналитикШтатнаяЕдиница.Вставить("Должность"		, Истина);
	СтруктураАналитикШтатнаяЕдиница.Вставить("Сотрудник"		, Ложь);
		
	СоответствиеВидовАналитик.Вставить(Перечисления.абс_ВидыАналитикиЗначенийПоказателейКПЭ.ШтатнаяЕдиница, СтруктураАналитикШтатнаяЕдиница);
	
	СтруктураАналитикСотрудник = Новый Структура();
	СтруктураАналитикСотрудник.Вставить("Подразделение"			, Ложь);
	СтруктураАналитикСотрудник.Вставить("Должность"				, Ложь);
	СтруктураАналитикСотрудник.Вставить("Сотрудник"				, Истина);
		
	СоответствиеВидовАналитик.Вставить(Перечисления.абс_ВидыАналитикиЗначенийПоказателейКПЭ.Сотрудник, СтруктураАналитикСотрудник);	
	
	Возврат СоответствиеВидовАналитик;
	
КонецФункции	

Процедура ПроверитьЗаполнениеЗаписейРегистра(Отказ)
	
	НастройкаВидовАналитик = ПолучитьСоответствиеВидовАналитик();
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		// Проверим заполнение аналитик
		Для Каждого НастройкаЗаполнения Из НастройкаВидовАналитик.Получить(ТекЗапись.ВидАналитикиКПЭ) Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекЗапись[НастройкаЗаполнения.Ключ]) = НастройкаЗаполнения.Значение Тогда
				
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Некорректно заполнены значения аналитик! Документ: " + ТекЗапись.Регистратор + ", номер строки: " + ТекЗапись.НомерСтроки + ".", Отказ);
				
			КонецЕсли;
      
		КонецЦикла;
		
		// Проверим заполнение плановой записи
		Если ТекЗапись.ВидОперации = Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.ПлановыеЗначения И ЗначениеЗаполнено(ТекЗапись.НомерКорректировки) Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Некорректно заполнена запись ввода плана, номер корректировки не должен быть заполнен! Документ: " + ТекЗапись.Регистратор + ", номер строки: " + ТекЗапись.НомерСтроки + ".", Отказ);
			
		КонецЕсли;
		
		// Проверим заполнение корректировочной записи
		Если ТекЗапись.ВидОперации = Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.КорректировкаПлановыхЗначений И НЕ ЗначениеЗаполнено(ТекЗапись.НомерКорректировки) Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Некорректно заполнена запись корректировки плана, должен быть заполнен номер корректировки! Документ: " + ТекЗапись.Регистратор + ", номер строки: " + ТекЗапись.НомерСтроки + ".", Отказ);
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры
